/**
 * 集中配置
 */

/* api前缀 */
export const api_prifix = "http://101.200.63.44:40010/visible";

//局域网连接
// export const api_prifix = "http://192.168.0.188:10010/visible";

/* 指标计算 */

// 效能指数中隶属度分量的权重
export const k = [40, 70, 100];

// C级指标
export type PrimaryFieldLine = [
  string,
  string,
  string,
  string,
  string,
  "benefit" | "cost",
  string,
  [number, number, number]
];



export const primary_field = JSON.parse(`
[
["C11", "啤酒生产计划完成率",         "生产管理部", "BrewingMES计算",      "月", "benefit", "%",    [85,99,102]],
["C21", "单位产量清洗时长",           "包装车间",   "BrewingMES计算",      "月", "cost",    "小时/千升", [5.5,4,1.5]],
["C22", "单位产量清洗频次",           "包装车间",   "BrewingMES计算",      "月", "cost",    "次/千升",   [6,3,1]],
["C23", "灌装设备运行效率",           "包装车间",   "Brewing运行系统", "月", "benefit", "%",    [90,98,100]],
["C24", "封盖设备运行效率",           "包装车间",   "Brewing运行系统", "月", "benefit", "%",    [75,85,95]],
["C31", "麦芽出糖率",                 "酿造车间",   "Brewing运行系统", "月", "cost",    "%",    [105,103,100]],
["C32", "单升啤酒消耗用瓶盖",         "包装车间",   "Brewing运行系统", "月", "cost",    "个/升",     [2550,2515,2500]],
["C33", "单升啤酒消耗用瓶",           "包装车间",   "Brewing运行系统", "月", "cost",    "个/升",     [3200,2970,2918]],
["C34", "单升啤酒残液量",             "包装车间",   "Brewing运行系统", "月", "cost",    "毫升/升",   [0.4,0.28,0.12]],
["C35", "单升啤酒消耗酵母",           "酿造车间",   "Brewing运行系统", "月", "cost",    "克/升",     [12550,12530,12500]],
["C36", "单升啤酒消耗麦芽",           "酿造车间",   "Brewing运行系统", "月", "cost",    "克",      [35,32.5,30]],
["C41", "生产过程异常次数",           "酿造车间",   "一车间",       "月", "cost",    "次",        [12,5,0]],
["C42", "成品啤酒检验优等品率",       "酿造车间",   "一车间",       "月", "benefit", "%",    [95,98,100]],
["C43", "发酵罐出口酒精度偏差",       "工艺质量",   "一车间",       "月", "cost",    "%",    [0.1,0.05,0.03]],
["C44", "过滤机出口浊度偏差",         "工艺质量",   "一车间",       "月", "cost",    "%",    [0.1,0.09,0.07]],
["C51", "啤酒泡沫稳定性合格率",       "包装车间",   "Brewing运行系统", "月", "benefit", "%",    [87,93,100]],
["C52", "啤酒口感CpK合格率",          "包装车间",   "Brewing运行系统", "月", "benefit", "%",    [70,80,100]],
["C53", "啤酒单升重量偏差",           "包装车间",   "Brewing运行系统", "月", "cost",    "克/升",      [20,16,14]],
["C54", "成品放行检验得分",           "包装车间",   "Brewing运行系统", "月", "benefit", "100",       [90,95,100]],
["C55", "产品优等品率",               "工艺质量",   "Brewing运行系统", "月", "benefit", "%",    [80,88,100]],
["C61", "单升啤酒能耗",               "动力车间",   "Brewing运行系统", "月", "cost",    "千瓦时/升",   [30,15,5]],
["C62", "单升啤酒污染排放量",         "动力车间",   "Brewing运行系统", "月", "cost",    "克/升",   [0.05,0.012,0.0025]],
["C63", "单升啤酒二氧化碳排放量",     "动力车间",   "Brewing运行系统", "月", "cost",    "克/升",   [28,12,2]]
]
`) as Array<PrimaryFieldLine>;

// B级指标
export type ABFieldLine = [string, string, Array<string>, Array<number>];

export const B_field = JSON.parse(`
[
["B1", "计划执行",   ["C11"],                               [1]],
["B2", "设备效率",   ["C21","C22","C23","C24"],             [0.194,0.136,0.298,0.372]],
["B3", "生产物耗",   ["C31","C32","C33","C34","C35","C36"], [0.1675,0.105,0.185,0.2125,0.155,0.175]],
["B4", "酿造工艺",   ["C41","C42","C43","C44"],             [0.38,0.236,0.188,0.196]],
["B5", "包装工艺", ["C51","C52","C53","C54","C55"],       [0.285,0.155,0.17,0.1725,0.2175]],
["B6", "节能减排",   ["C61","C62","C63"],                   [0.406,0.364,0.23]]
]
`) as Array<ABFieldLine>;

// A级指标
export const A_field = JSON.parse(`
["A", "综合效能", ["B1","B2","B3","B4","B5","B6"], [0.245,0.1775,0.1575,0.155,0.1625,0.1025]]
`) as ABFieldLine;

/* docx-templates 模板前缀 */
export const docxtpl_prefix = "/docxtpl/";
